[
 {
   "siteId": 10000,
   "title": "Why do I have to make Satisfactory Academic Progress (SAP) to receive financial aid?",
   "similar questions": [],
   "content": "Federal law requires that schools administering federal aid set a minimum academic performance standard in order to continue to receive financial aid. A school must monitor a student's qualitative (GPA) and quantitative (course completion) performance. The federal standards require a 2.0 cumulative GPA, 67 percent cumulative completion ratio, and total hours not to exceed 150 percent of the program."
 },
 {
   "siteId": 10000,
   "title": "If I am not making academic progress and am denied my aid, may I still receive my Federal Direct Loans?",
   "similar questions": [],
   "content": "No, SAP is calculated for all federal programs administered by the Office of Scholarships and Financial Aid at the University of Houston, including Federal Direct Loans."
 },
 {
   "siteId": 10000,
   "title": "What will cause my appeal to be rejected or denied?",
   "similar questions": [],
   "content": "If your appeal is not completed, properly signed, and if no corroborating documents are included, your appeal is considered incomplete. Students who miss the deadline or fail to turn in additional requested documents in a timely fashion will be denied. We encourage students to submit a thoughtful and well-worded typed statement, as this reflects on your commitment towards improving academic performance."
 },
 {
   "siteId": 10000,
   "title": "What do quantitative and qualitative measurements mean?",
   "similar questions": [],
   "content": "Qualitative measurements refer to your cumulative GPA.\nQuantitative measurements monitor:\n1.\tPercentage of courses completed: the number of courses you successfully completed versus the total number of courses you attempted.\n2.\tTotal attempted hours: the total number of courses you enrolled in to receive your degree."
 },
 {
   "siteId": 10000,
   "title": "Will my transfer credit count toward the quantitative measure of my academic performance?",
   "similar questions": [],
   "content": "Yes, the law requires that we consider all course work accepted by the University in our calculations of the ratio of courses completed and cumulative hours. However, transfer credits will not help improve your cumulative GPA at UH."
 },
 {
   "siteId": 10000,
   "title": "Is there a deadline to submit a SAP appeal?",
   "similar questions": [],
   "content": "Yes, to be eligible to appeal a loss of financial aid eligibility, students must submit both a Free Application for Federal Student Aid (FAFSA) and a complete financial aid SAP appeal. Students will receive an email sent to their destination email address providing the SAP appeal deadline. This deadline will also be posted on the SAP appeal form.  Students who are not meeting SAP and do not meet the printed deadline will not have their financial aid SAP appeals considered for the current term. These students may appeal for the next term."
 },
 {
   "siteId": 10000,
   "title": "If I am not meeting Satisfactory Academic Progress, will I be dropped by the fee payment deadline due to non-payment?",
   "similar questions": [],
   "content": "Students whose appeals are not received by the appeal submission deadline date are subject to being dropped from their classes due to non-payment, if they have not selected a payment or deferment plan."
 },
 {
   "siteId": 10000,
   "title": "How long after my appeal is approved will my financial aid funds be released?",
   "similar questions": [],
   "content": "If your appeal is approved prior to the first day of classes and you have fulfilled all disbursement requirements, loans will begin to apply within the first week of classes. If your appeal is approved after the first day of classes and you have fulfilled all disbursement requirements, your funds will be applied within five business days from the approval of the appeal. Remember that Federal Direct Loans require at least 6 credit hours of enrollment and completion of the Entrance Counseling and Master Promissory Note at StudentAid.gov.\nGrants will disburse the day after the Official Reporting Day, typically the thirteenth day of the semester. Remember that certain grants require minimum enrollment (i.e., 9 credit semester hours for TEXAS Grant)."
 },
 {
   "siteId": 10000,
   "title": "When will my appeal be reviewed?",
   "similar questions": [],
   "content": "We strongly encourage that you submit your completed SAP appeal as soon as possible to give the committee ample time to review it. Appeals will be reviewed within four (4) weeks of submission. If you submitted an incomplete SAP appeal and then turn in additional documents, it may take an additional four (4) weeks to process the documents submitted later. It is best to turn in a complete appeal with all corroborating documents by the deadline."
 },
 {
   "siteId": 10000,
   "title": "Where do I submit my Appeal Form?",
   "similar questions": [],
   "content": "Appeals can be uploaded via your myUH self-service account To Do List, faxed to our office at (713) 743-9098 or submitted in person to the SFA counter in the Welcome Center. When uploading your documents, please save all pages as one PDF for uploading. Visit uh.edu/sfaupload for instructions on how to use the To Do List upload feature. We encourage you to visit with an advisor to have your initial appeal reviewed for completion."
 },
 {
   "siteId": 10000,
   "title": "How many times can I submit an appeal?",
   "similar questions": [],
   "content": "You are only allowed to appeal once during your academic career until you are able to meet SAP again. Students who appeal, but fail to meet cumulative academic standards after the probation semester will lose their ability to appeal again, unless mitigating circumstance exist, and must pay out of pocket. Please contact the office to learn more about the mitigating appeal. You may be selected to turn in a SAP plan if we have deemed that it may take you more than one semester to cumulatively improve your academic performance. Once you meet cumulative standards, you regain your financial aid eligibility. If after regaining eligibility, you fail to meet SAP requirements again, you may submit another SAP appeal."
 },
 {
   "siteId": 10000,
   "title": "What if I meet SAP requirements during the year?",
   "similar questions": [],
   "content": "A student who meets SAP requirements during the year should contact Scholarships and Financial Aid for a review of their eligibility."
 },
 {
   "siteId": 10000,
   "title": "What are the requirements to complete the TASFA process?",
   "similar questions": [],
   "content": "To use this electronic application, you must be considered a Texas resident and your classification as a Texas resident must not be due to a waiver such as an in-state scholarship or an assistantship.\nSteps to Complete the TASFA process:\n'\tComplete the TASFA form.\n'\tFile Residency Affidavit with Office of the University Registrar regarding SB 1528. The deadline for this is the close of business day on the 12th day of class for the fall term.\n'\tMales should register with the selective service and attach a copy of the proof of registration.\n'\tUpload copies of the appropriate year tax transcripts.\n'\tIf you and/or your parents did not have to file a federal income tax return, but earned wages which were paid in cash, report those cash earnings on the TASFA."
 },
 {
   "siteId": 10000,
   "title": "I am not yet a U.S. permanent resident, but I do have a social security card or an employment authorization card. Can I fill out the FAFSA?",
   "similar questions": [],
   "content": "You are not able to fill out a FAFSA until you become a permanent resident or are an eligible noncitizen with an Arrival/Departure Record (I-94) showing one of the following:\n'\tRefugee\n'\tAsylum granted,\n'\tParolee (for a minimum of one year), or\n'\tCuban-Haitian entrant\nIf none of these apply to you but you are classified as a Texas resident, you may be eligible to pay the Texas in-state tuition rate. If you meet all the other requirements for the TASFA, you may apply for the TASFA application instead of the FAFSA. Students receiving in-state tuition through a waiver such as a competitive scholarship or an assistantship are not eligible to use the TASFA."
 },
 {
   "siteId": 10000,
   "title": "What is the official priority deadline to submit my TASFA and supporting documents?",
   "similar questions": [],
   "content": "Students are encouraged to submit their TASFA and all required documents by January 15 to be considered for maximum funding. Students who miss the priority deadline for initial submission may have their application process delayed or denied, and funding will be awarded by the order of the date of TASFA completion."
 },
 {
   "siteId": 10000,
   "title": "How much aid can I receive if I am approved for my application?",
   "similar questions": [],
   "content": "Approved TASFA application students can be awarded up to $6,000 between fall and spring semesters, which is $3,000 each semester. There are no additional funds set aside for summer TASFA aid. You must maintain at least a nine hour enrollment to be eligible for the grant disbursement."
 },
 {
   "siteId": 10000,
   "title": "I submitted the TASFA late or did not get awarded enough money from my TASFA application. How else can I receive additional funding?",
   "similar questions": [],
   "content": "Students with state residency may apply for a College Access Loan (CAL) with the state coordinating board. Students will need a co-signer who is a U.S. citizen to complete the process. For more information, please click here."
 },
 {
   "siteId": 10000,
   "title": "I have TASFA documents requested on my to-do list. When is the deadline? I see that there is a date listed.",
   "similar questions": [],
   "content": "Students should complete the application process as soon as possible to be considered for maximum funding, especially before that date. Any delays in submitting the verification items that are requested will result in delays in being awarded, as TASFA funding is limited."
 },
 {
   "siteId": 10000,
   "title": "I am a first time in college Texas resident classified as a non-Texas resident. What is the process to update my residency?",
   "similar questions": [],
   "content": "Students should submit a complete Residency Affidavit to the Office of the University Registrar. Forms are located in the UH website in the Office of Admissions Residency Requirements section."
 },
 {
   "siteId": 10000,
   "title": "How often do I need to submit my TASFA?",
   "similar questions": [],
   "content": "The TASFA should be submitted every academic year you plan to apply for aid by the Jan. 15 deadline prior to the start of the academic year. The online application for the upcoming year becomes available each Oct. 1."
 },
 {
   "siteId": 10000,
   "title": "I am a male and am having difficulty registering for selective service online. What are my options?",
   "similar questions": [],
   "content": "You may be able to complete a paper version of the selective service registration form. This form is available at most post offices or at sss.gov/forms; please call your local office regarding form availability at that location. Complete this registration form and mail it to the Selective Service System office.\nIf you are male between the ages of 18 and 25, you must register with Selective Service in order to qualify for any type of state aid (regardless of residency status). Noncitizens not required to register include men who are in the U.S. on student or visitor visas, and men who are part of a diplomatic or trade mission and their families. Almost all other male noncitizens are required to register, including undocumented residents, legal permanent residents, and refugees."
 },
 {
   "siteId": 10000,
   "title": "What are the electronic criteria to upload documents?",
   "similar questions": [],
   "content": "The documents must be in .PDF format only, and the file size limit is 25MB per PDF. If you are using the Financial Aid To Do List, documents comprised of multiple pages should be combined into a single PDF file first, and then uploaded. For example, if your tax transcript consists of 6 pages, please scan all 6 of those pages and save it as one PDF file that you can upload into your tax transcript To-Do List. The orientation of the text should match the orientation of the document file (i.e., portrait/landscape). You can upload multiple PDF files if you are using the Task Tile To Do List option.\nIf you are uploading a verification worksheet form, please ensure that the form is completed in dark ink and is clearly scanned.\nIf you are using the Financial Aid To Do List, once files are uploaded, the documents cannot be edited by the applicant. Ensure that you are submitting the correct documents for the specified To-Do List item. If you have added an incorrect file, you can navigate to the Task Tile Do List and add the corrected PDF file.\nIf you do not have access to a scanner, you may use services on campus."
 },
 {
   "siteId": 10000,
   "title": "Can all financial aid documents and forms be uploaded using this service?",
   "similar questions": [],
   "content": "Most of our documents can be uploaded using this feature but we do have some documents that are required to be submitted in person. These will be clearly marked on your To-Do List as not uploadable."
 },
 {
   "siteId": 10000,
   "title": "Can I include multiple scanned pages within each PDF?",
   "similar questions": [],
   "content": "If you are using the Financial Aid To Do List, and the documents are in the same group and are comprised of multiple pages, they should be combined into a single PDF file first, and then be uploaded to the appropriate To-Do List item. You can upload multiple PDF files to one To Do List item using the Task Tile To Do List Option. However, if the multiple scanned pages are applicable to multiple To Do List items, you must separate them so that only the correct documents are being uploaded into the appropriate To-Do List item. For example, if you are combining your parents' tax transcript and your tax transcript into one document and uploading it into the Parent Tax Transcript To-Do List item only, this will leave the student tax To-Do List item incomplete. The proper way to address this is to have one PDF file for the parent tax document and another separate PDF file for the student tax documents."
 },
 {
   "siteId": 10000,
   "title": "What if I accidentally submitted the wrong document? Can I submit another version?",
   "similar questions": [],
   "content": "All versions of the forms submitted must be stored in our imaging service. However, if you want to be able to upload another PDF for the same To-Do List item, navigate to the Task Tile To Do List and attach the correct PDF file making sure to save. You may also contact our office so that a representative can update your To-Do List item to \"Incomplete\" status. If your To Do List item is currently in a \"Received\" status, you can still upload the corrected PDF file(s) to that item via the Task Tile To Do List."
 },
 {
   "siteId": 10000,
   "title": "How long will my documents take to be processed after I upload them?",
   "similar questions": [],
   "content": "The processing time for uploaded verification documents are the same as those being submitted via fax, mail and at the Welcome Center counter. This process can take 3 ' 4 weeks and may be even longer during peak times throughout the year. These peak times consist of July, August and September."
 },
 {
   "siteId": 10000,
   "title": "May I use my cell phone application to scan documents and save them as a .PDF?",
   "similar questions": [],
   "content": "We recommend that students use the most secure and accessible method to scan documents that may contain sensitive information. If the PDF file meets the electronic criteria as listed above, you may use any method to scan the document. UH does not have a list of recommended smartphone apps for document scanning."
 },
 {
   "siteId": 10000,
   "title": "What is the Federal Work-Study Program?",
   "similar questions": [],
   "content": "The Federal Work-Study (FWS) Program is a government subsidized student employment program designed to assist students in financing their post-secondary education. In order to be eligible for Work-Study (WS), students must document financial need every year by completing the Free Application for Federal Student Aid (FAFSA)."
 },
 {
   "siteId": 10000,
   "title": "What is Texas Work-Study?",
   "similar questions": [],
   "content": "The Texas College Work-Study Program's purpose is to provide part-time jobs to eligible students with financial need to enable them to attend college. Students must be Texas residents and maintain enrollment of 6 credit hours."
 },
 {
   "siteId": 10000,
   "title": "What are the advantages of Work-Study jobs?",
   "similar questions": [],
   "content": "Although a WS job should be treated as any other job, it does have several distinct advantages:\n'\tStudents have the benefit of working in an environment suited to their skills, preferences and possible career goals.\n'\tStudents and Work-Study employers arrange a work schedule around the class schedule.\n'\tWork-Study wages are not counted towards next year's student contribution for financial aid.\n'\tAlthough the majority of WS positions are located on-campus, the program also offers a growing number of off-campus positions. Most off-campus locations are easily reached by automobile or city bus. Regardless of location, the ultimate advantage of a WS position is that it affords students invaluable experience when preparing to enter the job market after graduation, not to mention the departmental and/or professional contacts that can be made.\nStudies have consistently shown that students who work no more than 20 hours per week do better academically than students who do not work. Additional time demands appear to force students to manage their time more efficiently, thus necessitating a higher commitment to study time by the student."
 },
 {
   "siteId": 10000,
   "title": "Am I allowed to have more than one Work-Study job?",
   "similar questions": [],
   "content": "Students are not allowed to hold multiple UH paid positions while being employed as a CWS student."
 },
 {
   "siteId": 10000,
   "title": "I do not have Work-Study, who should I contact",
   "similar questions": [],
   "content": "If interested in CWS, please email a request to Workstudy@uh.edu or visit our office to be added to our waitlist. "
 },
 {
   "siteId": 10000,
   "title": "What types of jobs are available?",
   "similar questions": [],
   "content": "The On-Campus Work-Study jobs are as diverse as the personnel needs of the University. Clerical assistants, data entry operators, photography technicians, artists and laboratory research assistants are but a few examples.\nOff-campus positions with employers/agencies approved to participate in the Federal Work-Study Program offer further variety. These positions are available through non-profit organizations and are usually in areas of community service. Off-campus positions may include Photography, museum guides, public relations, editorial, research assistants, and tutors."
 },
 {
   "siteId": 10000,
   "title": "What is Community Service Work-Study?",
   "similar questions": [],
   "content": "Community Service Work-Study is a federally-funded program that allows students to earn their Work-Study award while serving the community in such areas as education, recreation, child care, health care, public safety, social services, crime prevention, emergency preparedness and response, and tutoring and mentoring.\nAlso, schools can now use Federal Work Study Program funds to compensate students employed in projects that teach civics in schools, raise awareness of government functions or resources, or increase civic participation.\nCommunity Service positions benefit the student as well as the community by increasing awareness of community needs through employment in areas that are dedicated to improving the quality of life for community residents--particularly low-income individuals--or to solve problems related to their needs.\nBut Community Service is much more than a definition. . . It's the satisfaction you get from knowing that through your time and efforts, you've helped to make your corner of the world a better place to live. Community Service Work-Study is a great way to make a difference in the lives of others and earn your Work-Study (WS) award at the same time. UH Career Service's provides information about the advantages of Community Services employment. Whatever your interests, there is an agency in Houston that can provide you with satisfying and meaningful work experience."
 },
 {
   "siteId": 10000,
   "title": "How much will I be paid?",
   "similar questions": [],
   "content": "All jobs offer competitive wages and most pay more than minimum wage based upon experience and skills. The job titles, duties and hourly rates are the same as those for non-WS employees. WS students must also have the same job qualifications as non-WS individuals. Students working at University of Houston- under the Work-Study Program are paid on an hourly-wage basis under wage regulations set by the University's Office of Human Resources. WS students working off-campus are also paid on an hourly basis at wage rates set by the Off-Campus employer."
 },
 {
   "siteId": 10000,
   "title": "Am I eligible for benefits?",
   "similar questions": [],
   "content": "No. Work-Study (WS) students are not eligible for paid vacation, sick leave, holidays, or medical and dental insurance through their Work-Study job."
 },
 {
   "siteId": 10000,
   "title": "How much can I earn?",
   "similar questions": [],
   "content": "Students may earn up to the amount of their award as listed on the Financial Aid Notification or the Work-Study Authorization Form. Students may not earn more than the amount of the Work-Study (WS) award.\nThe Federal Work-Study Program reimburses employers 100% of the students' earnings up to the amount of the award. Any wages earned after that amount must be paid 100% by the employer. It is the student's and employer's responsibility to monitor earnings to be sure the award amounts are not exceeded.\n\nAny scholarship counts as a financial resource and must be considered when constructing a student award package. Total student aid cannot exceed a student's cost of attendance. The cost of attendance (COA) is an estimate of what it costs the typical student to attend the University of Houston. Your COA includes tuition and fees, room and board, books and supplies, transportation and personal expenses. University of Houston awards are subject to change depending on the entire student award package and the students' COA."
 },
 {
   "siteId": 10000,
   "title": "What are the required working hours?",
   "similar questions": [],
   "content": "The work schedule is to be determined by the student and employer. The following guidelines apply.\n'\tStudents should never be scheduled to work during class time.\n'\tStudents should never work more than 8 hours in one day\n'\tStudents should never work more than 20 hours in one week while classes are in session.\n'\tStudents must take a 30-minute break if allowed to work a consecutive 6 hour period.\n'\tStudent may work up to 39 hours in one week only during approved breaks when classes are not in session."
 },
 {
   "siteId": 10000,
   "title": "How do I apply for a job?",
   "similar questions": [],
   "content": "To apply for Work-Study jobs, you must accept your Work-Study award via your?myUH self-service account. After accepting the award and enrolling in the minimum of six (6) credit hours, you will have access to apply for any job posting on Cougar Pathway within four weeks prior to the start of the semester."
 },
 {
   "siteId": 10000,
   "title": "What if I do NOT get a job?",
   "similar questions": [],
   "content": "If students are enrolled at least half-time and do not get a Work-Study job within the first two weeks of the start of class, their Work-Study award will be canceled for the academic year. Once canceled, the Work-Study awards ' will not be reinstated. In addition, this may jeopardize the awarding of any future Work-Study."
 },
 {
   "siteId": 10000,
   "title": "How do I get my Work-Study money?",
   "similar questions": [],
   "content": "To receive their Work-Study funds, students must get a job, work no more than 20 hours per week, and earn it! Students are strongly encouraged to begin the job search as early as possible. Many popular WS positions are highly sought after and tend to be filled fast!\nUpon hiring by The University of Houston, the hiring department must complete the Electronic On-Campus Position Action Request (EPAR) and submit it through workflow. The hiring department also ensures the student completes:\n'\tThe University of Houston's Personal Data Sheet, Public Access Authorization, Selective Service Registration, Federal Employment Inquiry, Patent Disclosure and Assignment Agreement and Direct Deposit Acknowledgement and acknowledgment of Personal Documents Receipt\n'\tThe INS Employment Eligibility Verification (I-9) must be completed within three days of hire. The Authorization to Work section provides information about the documents required for proof of citizenship\n'\tForm W-4 Employee's Withholding Allowance Certificate.\nWork-Study students are paid bi-weekly. On Campus employees work week always begins on Wednesday and ends on Tuesday. Work-Study students must sign in for work as they report to work and sign out as they leave on each occasion.\nUpon hire by an off-campus employer approved to participate in the Federal Work-Study Program, the Work-Study student will be paid according the Agency Payroll Schedule, which must be on file in the University's College Work-Study Office."
 },
 {
   "siteId": 10000,
   "title": "Will I get Work-Study every semester?",
   "similar questions": [],
   "content": "Work-Study eligibility is based upon performing the assigned job duties in a satisfactory manner, maintaining satisfactory academic progress, continuing to show financial need, and the timeliness of your Financial Aid Application.\nIf a student's eligibility changes at any time during the award period, the WS award (as well as any other financial aid awards) may be re-evaluated. This often occurs when the Office of Scholarships & Financial Aid learns of additional resources, e.g. scholarships or tuition waivers, and must reduce the amount of WS award.\nAlso, eligibility from one year to the next is not guaranteed. Each year students must complete a need-analysis form called the Free Application for Federal Student Aid (FAFSA) to determine eligibility for financial aid, including Work-Study. Students should apply by the April1st priority deadline, since Work-Study funding is limited.\nAs with all Financial Aid Satisfactory academic progress is monitored. Under no circumstances may students continue Work-Study employment after dropping below half-time enrollment."
 },
 {
   "siteId": 10000,
   "title": "Rights and Responsibilities for Work-Study",
   "similar questions": [],
   "content": "By accepting a WS position, students become members of a department or agency that depends on them.\n'\tStudents should report to work on time, notify the supervisor when they will be late or absent, and dress appropriately for the work location (dress code should be discussed during the interview).\n'\tWhen asking for time off, students should consider the employer's needs as well as their own.\n'\tIn addition, some WS positions may require access to confidential information--abuse or misuse of such authorization is grounds for dismissal!\n'\tStudents cannot earn more than the Work-Study award as listed on the Financial Aid Notification.\n'\tIt is the student's and employer's responsibility to monitor earnings to be sure they do not exceed the award amount using the Work-Study Balance Sheet.\n'\tIf a problem develops on the job, the first point of contact should be the supervisor.\n'\tIf the problem cannot be resolved, the student should contact the Work-Study Office in the Office of Scholarships & Financial Aid.\n'\tQuitting a WS job should be a decision of last resort.\n'\tThere is no guarantee that the Work-Study award can be replaced with another type of aid or that the student can secure another WS position.\n'\tStudents agree to abide by the regulations and policies as outlined in the Work-Study Employee Manual.\n'\tFailure to follow these policies and regulations may result in the cancellation of their Work-Study award and the loss of their Work-Study position.\n'\tAcceptance of a position through Work-Study implies a commitment to the employer for at least one semester."
 },
 {
   "siteId": 10000,
   "title": "Additional Employment for Work-Study",
   "similar questions": [],
   "content": "If WS students earn the total amount of the WS award prior to the end of the award period, they may wish to continue their work relationship with the employer. This is considered additional employment, not another Work-Study position and the employer must pay 100% of the student's wages out of their own funds. Income earned in the non-WS position will be treated as base-year income and will be counted toward next year's student contribution for financial aid. Before accepting additional employment, the student may want to discuss the implications of such employment with the Office of Scholarships & Financial Aid."
 },
 {
   "siteId": 10000,
   "title": "How does Cougar Promise work and what does it cover?",
   "similar questions": [],
   "content": "The University of Houston Cougar Promise covers both tuition and mandatory fees for eligible students and students from families with an Adjusted Gross Income (AGI) of $65,000 or less. Independent or dependent students with an AGI from $65,001 to $125,000 may qualify for tuition support ranging from $500 to $2,000. Cougar Promise utilizes a combination of grants (i.e., Pell, TEXAS and institutional grants, etc.) and various other resources as determined by the FAFSA or TASFA. Please note that if a student loses eligibility for TEXAS Grant due to being in arrears on child support, student will also lose Cougar Promise eligibility."
 },
 {
   "siteId": 10000,
   "title": "What is the application deadline for the Cougar Promise?",
   "similar questions": [],
   "content": "Cougar Promise does not require a separate application process. You must submit all your required admissions documents and complete the Free Application for Federal Student Aid (FAFSA) or the Texas Application for State Financial Aid (TASFA) by the priority deadline of January 15 to be considered. Submit all requested financial aid forms and supporting documents by this same date. You must provide a valid social security number to UH on your application for admission or directly to the Office of the University Registrar by the priority deadline to allow for processing of your FAFSA and consideration for Cougar Promise. Because students do not know in advance if they have been chosen for verification, families should consider submitting the FAFSA by December 1."
 },
 {
   "siteId": 10000,
   "title": "Does Cougar Promise provide assistance for transfer students?",
   "similar questions": [],
   "content": "Cougar Promise is a program for new entering freshmen. However, the University of Houston offers eligible transfer students the Transfer Excellence and Transfer Achievement scholarships, along with an array of federal, state and institutional grants, loans and work-study."
 },
 {
   "siteId": 10000,
   "title": "Does Cougar Promise require full-time enrollment?",
   "similar questions": [],
   "content": "Yes, students are required to be enrolled in a minimum of 12 credits at the University of Houston for both fall and spring terms. We strongly encourage students to enroll in 15 credits per term to ensure on-time graduation."
 },
 {
   "siteId": 10000,
   "title": "Is Cougar Promise available for summer terms?",
   "similar questions": [],
   "content": "Cougar Promise is a fall and spring program."
 },
 {
   "siteId": 10000,
   "title": "Is Cougar Promise renewable?",
   "similar questions": [],
   "content": "Yes, Cougar Promise is available for up to four years or five years for the Bachelor of Architecture 160 credit degree plan. To be eligible for renewal students must earn at least a 2.5 cumulative GPA and a minimum of 24 credit hours per academic year. Thirty credit hours per year are preferable to ensure on-time graduation. Students must file a FAFSA or TASFA each year by the State of Texas priority deadline and maintain income and need eligibility."
 }
]